<?php

return [
	'type' => [
		1 => '奖励金额',
		2 => '罚款',
		3 => '奖励权重',
		4 => '惩罚权重',
		5 => '禁止接单一天',
		6 => '订单退款',
	],

	'status' => [
		0 => '禁止接单一天处罚待进行',
		1 => '等待处理',
		2 => '处理完成',
		// 21 => '待交罚款',
		// 22 => '已交罚款',
		// 31 => '待加权重',
		// 32 => '已加权重',
		// 41 => '待减权重',
		// 42 => '已减权重',
		// 61 => '等待订单退款',
		// 62 => '订单退款完成',
		9  => '申诉中',
		10 => '申诉驳回并已处罚',
		11 => '已撤销',
		12 => '禁止接单一天处罚已结束',
	],

	'confirm' => [
		0 => '待确认',
		1 => '已确认',
	],

	// 订单退款最大天数
	'order_refund_max_days' => 7,
];
