<?php
// 交易
return [
    'user_display' => [
        1 => '加款',
        2 => '减款',
        3 => '冻结',
        4 => '解冻',
        7 => '支出',
        8 => '收入',
    ],
    'user' => [
        1 => '加款',
        2 => '减款',
        3 => '冻结',
        4 => '解冻',
        5 => '支出', //扣款
        6 => '收入', // 退款
        7 => '支出',
        8 => '收入',
    ],

    'user_sub' => [
        11 => '自动加款',
        12 => '手动加款',
        13 => '奖励加款',
        21 => '手动提现',
        22 => '手动减款',
        23 => '自动提现',
        31 => '提现冻结',
        32 => '抢单冻结',
        33 => '减款冻结',
        41 => '提现解冻',
        42 => '抢单解冻',
        51 => '手续费支出',
        52 => '违规扣款',
        53 => '奖励撤销扣款',
        54 => '短信费',
        55 => 'steam手续费扣款',
        56 => 'steam游戏扣款',
        61 => '手续费退款',
        62 => '违规退款',
        63 => 'steam手续费退款',
        64 => 'steam游戏退款',
        71 => '订单集市支出',
        72 => '订单售后扣款',
        // 代练 支出
        73 => '代练手续费支出', // 发单
        74 => '安全保证金支出', // 接单
        75 => '效率保证金支出', // 接单
        76 => '代练下单支出',
        77 => '游戏代练加款',
        78 => '支付订单集市押金',
        79 => '订单投诉支出', // 订单后完后,商户发起投诉支出相应费用

        81 => '订单集市收入',
        82 => '发货失败退款',
        83 => '售后退款',
        84 => '取消订单退款',
        85 => '订单售后退款',
        // 代练 收入
        86 => '代练手续费收入', // 接单
        87 => '退还代练费', // 发单
        88 => '退还安全保证金', // 接单
        89 => '退还效率保证金', // 接单
        810 => '安全保证金收入', // 发单
        811 => '效率保证金收入', // 发单
        812 => '代练收入', // 接单
        813 => '代练撤消退款',
        814 => '代练改价退款',
        815 => '保证金退款',
        816 => '退还订单集市押金',
        817 => '订单投诉收入', // 订单后完后,商户可发起投诉获得赔付
    ],

    'platform' => [
        1 => '用户加款',
        2 => '用户减款',
        3 => '用户冻结',
        4 => '用户解冻',
        5 => '扣用户款',
        6 => '退款给用户',
        7 => '用户支出',
        8 => '用户收入',
    ],

    'platform_sub' => [
        11 => '自动加款',
        12 => '手动加款',
        21 => '手动提现',
        22 => '手动减款',
        23 => '自动提现',
        31 => '提现冻结',
        32 => '抢单冻结',
        33 => '减款冻结',
        41 => '提现解冻',
        42 => '抢单解冻',
        51 => '手续费支出',
        52 => '违规扣款',
        53 => '奖励撤销扣款',
        54 => '短信费',
        55 => 'steam手续费扣款',
        56 => 'steam游戏扣款',
        61 => '手续费退款',
        62 => '违规退款',
        63 => 'steam手续费退款',
        64 => 'steam游戏退款',
        71 => '订单集市支出',
        72 => '订单售后扣款',
        // 代练 支出
        73 => '代练手续费支出', // 发单
        74 => '安全保证金支出', // 接单
        75 => '效率保证金支出', // 接单
        76 => '代练下单支出',
        77 => '游戏代练加款',
        78 => '扣订单集市押金',
        79 => '订单投诉支出', // 订单后完后,商户发起投诉支出相应费用

        81 => '订单集市收入',
        82 => '发货失败退款',
        83 => '售后退款',
        84 => '取消订单退款',
        85 => '订单售后退款',

        // 代练 收入
        86 => '代练手续费收入', // 接单
        87 => '退还代练费', // 发单
        88 => '退还安全保证金', // 接单
        89 => '退还效率保证金', // 接单
        810 => '安全保证金收入', // 发单
        811 => '效率保证金收入', // 发单
        812 => '代练收入', // 接单
        813 => '代练撤消退款',
        814 => '代练改价退款',
        815 => '保证金退款',

        816 => '退订单集市押金',
        817 => '订单投诉收入', // 订单后完后,商户可发起投诉获得赔付
    ],
];
